""" 
4. Створіть функцію <morse_code>, яка приймає на вхід рядок у вигляді 
коду Морзе та виводить декодоване значення (латинськими літерами).

   Особливості:
    - використовуються лише крапки, тире і пробіли (.- )
    - один пробіл означає нову літеру
    - три пробіли означають нове слово
    - результат може бути case-insensetive (на ваш розсуд - великими
чи маленькими літерами).
    - для простоти реалізації - цифри, знаки пунктуацїї, дужки, лапки
тощо використовуватися не будуть. Лише латинські літери.
    - додайте можливість декодування сервісного сигналу SOS (...---...)

Приклад:
    --. . . -.- .... ..- -...   .. ...   .... . .-. .
    результат: GEEKHUB IS HERE
"""


def morse_code(input_string):
    morse_dict = {
        ".-": "A",
        "-...": "B",
        "-.-.": "C",
        "-..": "D",
        ".": "E",
        "..-.": "F",
        "--.": "G",
        "....": "H",
        "..": "I",
        ".---": "J",
        "-.-": "K",
        ".-..": "L",
        "--": "M",
        "-.": "N",
        "---": "O",
        ".--.": "P",
        "--.-": "Q",
        ".-.": "R",
        "...": "S",
        "-": "T",
        "..-": "U",
        "...-": "V",
        ".--": "W",
        "-..-": "X",
        "-.--": "Y",
        "--..": "Z",
        "...---...": "SOS"
    }

    result = []
    input_words = input_string.split('   ')

    for word in input_words:
        input_letters = word.split(' ')

        for letter in input_letters:

            for key, value in morse_dict.items():
                if letter == key:
                    result.append(value)

        result.append(' ')

    return ''.join(result)


print(morse_code('--. . . -.- .... ..- -...   .. ...   .... . .-. .'))
print(morse_code('...---...'))
