""" 4. Наприклад маємо рядок : -> просто потицяв по клавi =)
--> "f98neroi4nr0c3n30irn03ien3c0rfe  kdno400wenwkow
-->     e00koijn35pijnp46ij7k5j78p3kj546p4 65jnpoj35po6j345"
 
   Створіть ф-цiю, яка буде отримувати рядки на зразок цього та яка
   оброблює наступні випадки:
-  якщо довжина рядка в діапазонi 30-50 (включно) 
    -> прiнтує довжину рядка, кiлькiсть букв та цифр
-  якщо довжина менше 30 
    -> прiнтує суму всiх чисел та окремо рядок без цифр 
    лише з буквами (без пробілів)
-  якщо довжина більше 50 
    -> щось вигадайте самі, проявіть фантазію =)
"""

